In [3]:
import pandas as pd
data_frame = pd.read_csv('./salaries.csv')
data_frame.shape # 16494 Rows, 11 cols

(16494, 11)

In [25]:
data_frame.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2024,MI,FT,Data Scientist,120000,USD,120000,AU,0,AU,S
1,2024,MI,FT,Data Scientist,70000,USD,70000,AU,0,AU,S
2,2024,MI,CT,Data Scientist,130000,USD,130000,US,0,US,M
3,2024,MI,CT,Data Scientist,110000,USD,110000,US,0,US,M
4,2024,MI,FT,Data Science Manager,240000,USD,240000,US,0,US,M

In [26]:
US_ml_salary = data_frame[data_frame['employee_residence'] == 'US'] # This filters to only include people residing in US

In [28]:
US_ml_salary.describe()

          work_year         salary  salary_in_usd  remote_ratio
count  14427.000000   14427.000000   14427.000000  14427.000000
mean    2023.264504  157203.378596  157220.590351     30.810286
std        0.662238   65632.162552   65607.974121     46.089885
min     2020.000000   24000.000000   24000.000000      0.000000
25%     2023.000000  111600.000000  111600.000000      0.000000
50%     2023.000000  148000.000000  148000.000000      0.000000
75%     2024.000000  191475.000000  191475.000000    100.000000
max     2024.000000  750000.000000  750000.000000    100.000000

In [30]:
print('{:.2f}'.format(US_ml_salary['salary'].mean()))

157203.38